Revit 2027 API
UnitUtils.IsMeasurableSpec Method
 Checks whether a ForgeTypeId identifies a spec associated with units of measurement.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsMeasurableSpec(
	ForgeTypeId specTypeId
)
Public Shared Function IsMeasurableSpec (
	specTypeId As ForgeTypeId
) As Boolean
public:
static bool IsMeasurableSpec(
	ForgeTypeId^ specTypeId
)
static member IsMeasurableSpec :
        specTypeId : ForgeTypeId -> bool
Parameters
specTypeId ForgeTypeId
 The identifier to check.
Return Value
Boolean
 True if the ForgeTypeId identifies a measurable spec, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace